In [1]:
import pandas as pd

In [11]:
df=pd.read_excel("test.xlsx")

In [14]:
df.head()

   S.NO         NAME   AGE  MARKS
0     1  G.GNANENDRA  18.0  39per
1     2  G.VEERENDRA  16.0  30per
2     3          SAI  19.0  41per
3     4       SONITH   NaN  18per
4     5        SAINA  10.0  43per

In [15]:
df['MARKS'].value_counts()

39per    1
30per    1
41per    1
18per    1
43per    1
Name: MARKS, dtype: int64

In [30]:
encode={'MARKS':{"39per":39,
    "30per":30,
    "41per":41,
    "18per":18,
    "43per":43}
    
}

In [31]:
encoded_df=df.replace(encode)

In [32]:
encoded_df

   S.NO         NAME   AGE  MARKS
0     1  G.GNANENDRA  18.0     39
1     2  G.VEERENDRA  16.0     30
2     3          SAI  19.0     41
3     4       SONITH   NaN     18
4     5        SAINA  10.0     43

In [33]:
output=encoded_df.to_excel('mark.xlsx')

In [34]:
pd.read_excel('mark.xlsx')

   Unnamed: 0  S.NO         NAME   AGE  MARKS
0           0     1  G.GNANENDRA  18.0     39
1           1     2  G.VEERENDRA  16.0     30
2           2     3          SAI  19.0     41
3           3     4       SONITH   NaN     18
4           4     5        SAINA  10.0     43

In [35]:
df.head(3)

   S.NO         NAME   AGE  MARKS
0     1  G.GNANENDRA  18.0  39per
1     2  G.VEERENDRA  16.0  30per
2     3          SAI  19.0  41per

In [36]:
data=pd.read_excel("test.xlsx")

In [37]:
data.head(3)

   S.NO         NAME   AGE  MARKS
0     1  G.GNANENDRA  18.0  39per
1     2  G.VEERENDRA  16.0  30per
2     3          SAI  19.0  41per

In [26]:
type(data['MARKS'])

pandas.core.series.Series

In [27]:
data.dtypes

S.NO       int64
NAME      object
AGE      float64
MARKS     object
dtype: object

In [39]:
data['MARKS']=data['MARKS'].astype('category')

In [40]:
data.dtypes

S.NO        int64
NAME       object
AGE       float64
MARKS    category
dtype: object

In [44]:
data['MARKS_NEW']=data['MARKS'].cat.codes

In [42]:
data

   S.NO         NAME   AGE  MARKS  MARKS_NEW
0     1  G.GNANENDRA  18.0  39per          2
1     2  G.VEERENDRA  16.0  30per          1
2     3          SAI  19.0  41per          3
3     4       SONITH   NaN  18per          0
4     5        SAINA  10.0  43per          4

In [45]:
pd.get_dummies(data, columns=['MARKS']).head()

,S.NO,NAME,AGE,MARKS_NEW,MARKS_18per,MARKS_30per,MARKS_39per,MARKS_41per,MARKS_43per
0,1,G.GNANENDRA,18.0,2,0,0,1,0,0
1,2,G.VEERENDRA,16.0,1,0,1,0,0,0
2,3,SAI,19.0,3,0,0,0,1,0
3,4,SONITH,NaN,0,1,0,0,0,0
4,5,SAINA,10.0,4,0,0,0,0,1

In [46]:
from sklearn.preprocessing import OrdinalEncoder

In [47]:
obj=OrdinalEncoder()

In [50]:
data['encode']=obj.fit_transform(data[['MARKS']])

In [51]:
data.head(4)

   S.NO         NAME   AGE  MARKS  MARKS_NEW  encode
0     1  G.GNANENDRA  18.0  39per          2     2.0
1     2  G.VEERENDRA  16.0  30per          1     1.0
2     3          SAI  19.0  41per          3     3.0
3     4       SONITH   NaN  18per          0     0.0

In [53]:
data.value_counts

<bound method DataFrame.value_counts of    S.NO         NAME   AGE  MARKS  MARKS_NEW  encode
0     1  G.GNANENDRA  18.0  39per          2     2.0
1     2  G.VEERENDRA  16.0  30per          1     1.0
2     3          SAI  19.0  41per          3     3.0
3     4       SONITH   NaN  18per          0     0.0
4     5        SAINA  10.0  43per          4     4.0>